W6D4/first_routes/app/controllers/artwork_shares_controller.rb

INSERT INTO "artwork_shares" ("artwork_id", "viewer_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["artwork_id", 2], ["viewer_id", 3], ["created_at", "2020-08-13 13:25:54.315006"], ["updated_at", "2020-08-13 13:25:54.315006"]]
---
    def create
        artwork_share = ArtworkShare.new(share_params)
        if artwork_share.save