W6D4/first_routes/app/controllers/artworks_controller.rb

SELECT "artworks".* FROM "artworks" INNER JOIN "users" ON "users"."id" = "artworks"."artist_id" INNER JOIN "artwork_shares" ON "artwork_shares"."artwork_id" = "artworks"."id" INNER JOIN "users" "shared_viewers_artworks" ON "shared_viewers_artworks"."id" = "artwork_shares"."viewer_id" WHERE "artworks"."artist_id" IS NULL AND (artwork_shares.viewer_id = NULL)
---
    def index

        @artworks = Artwork.select("DISTINCT artworks.*").left_joins(:shared_viewers).where("artworks.artist_id = ? OR artwork_shares.viewer_id = ?", params[:id], params[:id])

SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
UPDATE "artworks" SET "title" = $1, "updated_at" = $2 WHERE "artworks"."id" = $3  [["title", "definitely a title"], ["updated_at", "2020-08-12 21:08:43.621939"], ["id", 5]]
---
    def update
        @artwork = Artwork.find(params[:id])

        if @artwork.update(artwork_params)