W6D4/first_routes/app/controllers/comments_controller.rb

    def create

        comment = Comment.new(comment_params)

        if comment.save
---
INSERT INTO "comments" ("user_id", "artwork_id", "body") VALUES ($1, $2, $3) RETURNING "id"  [["user_id", 3], ["artwork_id", 2], ["body", "odlajskndasihdas8hd8h29hasidubasidb"]]

    def index
        # byebug
        if comment_params.has_key?(:user_id)
            comments = Comment.where("user_id = ?", comment_params[:user_id])
        elsif comment_params.has_key?(:artwork_id)
            comments = Comment.where("artwork_id = ?", comment_params[:artwork_id])
---
SELECT "comments".* FROM "comments" WHERE (artwork_id = '1')