W6D4/first_routes/app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE (username iLIKE '%george%')
SELECT  "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT $1  [["LIMIT", 1]]
---
    def index

        if params.has_key?("username")
            @users = User.where("username iLIKE ?", "%#{params["username"]}%")
        else
            @users = User.all

SELECT artworks.* FROM "users" INNER JOIN "collections" ON "collections"."user_id" = "users"."id" INNER JOIN "collection_pieces" ON "collection_pieces"."collection_id" = "collections"."id" INNER JOIN "artworks" ON "artworks"."id" = "collection_pieces"."artwork_id" WHERE (users.id = '3' AND collections.collection_name = 'favorites')
---
    def collection
        if params.has_key?(:collection_name)
            collection = User.select("artworks.*").joins(:collection_pieces).where("users.id = ? AND collections.collection_name = ?", params[:id], params[:collection_name])
        else
            collection = User.select("collections.*").joins(:collections).where("users.id = ?", params[:id])