W6D5/cat_project/app/controllers/cats_controller.rb

    def update
        @cat = Cat.find(params[:id])

        debugger
        if @cat.persisted? && @cat.update(cat_params)
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "cats" SET "color" = $1, "sex" = $2, "birth_date" = $3, "description" = $4, "updated_at" = $5 WHERE "cats"."id" = $6  [["color", "black"], ["sex", "on"], ["birth_date", "2009-09-02"], ["description", "asdasdasdasd"], ["updated_at", "2020-08-14 20:46:06.848431"], ["id", 2]]